userInterfaceHeader = \u0418\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044F. \u0414\u043B\u044F \u0432\u044B\u0445\u043E\u0434\u0430 \u043D\u0430\u0436\u043C\u0438\u0442\u0435 'q/Q'
userInterfaceFirstEntry = 1: \u0418\u0437\u0432\u043B\u0435\u0447\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439, \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u043F\u043E \u0432\u0435\u0441\u0443 \u0432 \u043A\u0430\u0440\u0430\u0442\u0430\u0445
userInterfaceSecondEntry = 2: \u0418\u0437\u0432\u043B\u0435\u0447\u044C \u043E\u0431\u0449\u0435\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0438 \u0432\u0435\u0441 \u044E\u0432\u0435\u043B\u0438\u0440\u043D\u044B\u0445 \u0438\u0437\u0434\u0435\u043B\u0438\u0439 (\u0446\u0435\u043D\u0430/\u043A\u0430\u0440\u0430\u0442)
userInterfaceThirdEntry = 3: \u0418\u0437\u0432\u043B\u0435\u0447\u044C \u0441\u043F\u0438\u0441\u043E\u043A \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439, \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u044C \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u043F\u0440\u0435\u0432\u043E\u0441\u0445\u043E\u0434\u0438\u0442 \u0437\u0430\u0434\u0430\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 (\u0437\u0430\u0434\u0430\u0435\u0442\u0441\u044F \u0441 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u044B)
userInterfaceFourthEntry = 4: \u0421\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F \u0432 \u0444\u0430\u0439\u043B
userInterfaceFifthEntry = 5: \u0414\u0435\u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F \u0438\u0437 \u0444\u0430\u0439\u043B\u0430

alreadyQuitting? = \u041F\u043E\u0432\u0442\u043E\u0440\u0438\u0442\u044C \u043F\u0440\u043E\u0446\u0435\u0441\u0441 \u043F\u0440\u043E\u0438\u0437\u0432\u043E\u0434\u0441\u0442\u0432\u0430? (y/n)

transparencyValue = \u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438 \u0434\u043B\u044F \u0434\u0430\u043B\u044C\u043D\u0435\u0439\u0448\u0435\u0433\u043E \u043E\u0442\u0431\u043E\u0440\u0430
incorrectTransparency = \u0412\u0432\u0435\u0434\u0435\u043D\u043E \u043D\u0435 \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438
errMessNoNegativeTransparency = \u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438 \u043D\u0435 \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043E\u0442\u0440\u0438\u0446\u0430\u0442\u0435\u043B\u044C\u043D\u044B\u043C
successfulSerializationMess = \u041F\u0440\u0438\u043C\u0435\u0440 \u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438. \u0421\u043F\u0438\u0441\u043E\u043A \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439, \u0443 \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438 \u043C\u0435\u043D\u044C\u0448\u0435 10 \u0437\u0430\u043F\u0438\u0441\u0430\u043D \u0432 \u0444\u0430\u0439\u043B
successfulDeserializationMess = \u0414\u0435\u0441\u0435\u0440\u0438\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u044F. \u041E\u0431\u044A\u0435\u043A\u0442\u044B \u0443\u0441\u043F\u0435\u0448\u043D\u043E \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u043D\u044B \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 \u0438 \u0432\u044B\u0432\u0435\u0434\u0435\u043D\u044B \u043D\u0430 \u043F\u0435\u0447\u0430\u0442\u044C. \u0423\u0440\u0430! 

workUpon =  \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442 \u043D\u0430\u0434
consider = \u043F\u043B\u0430\u043D\u0438\u0440\u0443\u0435\u0442 \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u044D\u0442\u043E \u0438\u0437

PG = \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439
SPG = \u043F\u043E\u043B\u0443\u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439
tableDescription1 = \u041F\u0435\u0440\u0435\u0447\u0435\u043D\u044C \u0432\u0441\u0435\u0445 \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439, \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0432 \u043F\u043E\u0440\u044F\u0434\u043A\u0435 \u0432\u043E\u0437\u0440\u0430\u0441\u0442\u0430\u043D\u0438\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0438\u0445 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438
tableDescription2 = \u041F\u0435\u0440\u0435\u0447\u0435\u043D\u044C \u0432\u0441\u0435\u0445 \u043F\u043E\u043B\u0443\u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u044B\u0445 \u043A\u0430\u043C\u043D\u0435\u0439, \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0439 \u0432 \u043F\u043E\u0440\u044F\u0434\u043A\u0435 \u0432\u043E\u0437\u0440\u0430\u0441\u0442\u0430\u043D\u0438\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0438\u0445 \u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438

carat = \u043A\u0430\u0440\u0430\u0442
gemEstimation1 = \u041E\u0431\u0449\u0430\u044F \u0446\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u043A\u0430\u043C\u043D\u0435\u0439 \u0435\u0449\u0435 \u043D\u0435 \u043E\u0446\u0435\u043D\u0438\u0432\u0430\u043B\u0430\u0441\u044C.
gemEstimation2 = \u0412\u044B\u0431\u0435\u0440\u0438\u0442\u0435 \u043F\u0435\u0440\u0432\u044B\u0439 \u043F\u0443\u043D\u043A\u0442 \u043C\u0435\u043D\u044E \u0434\u043B\u044F \u043E\u0431\u0449\u0435\u0439 \u043E\u0446\u0435\u043D\u043A\u0438 \u043A\u0430\u043C\u043D\u0435\u0439
gemEstimation3 = \u041E\u0431\u0449\u0430\u044F \u0446\u0435\u043D\u043D\u043E\u0441\u0442\u044C \u043A\u0430\u043C\u043D\u0435\u0439 \u0432 \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u043E\u043C \u0438\u0437\u0434\u0435\u043B\u0438\u0438:
gemEstimation4 = \u041A \u043F\u0440\u0438\u043C\u0435\u0440\u0443, \u0441 \u0446\u0435\u043D\u043E\u0439 1 200 \u0434\u043E\u043B\u043B\u0430\u0440\u043E\u0432 \u0437\u0430 \u043A\u0430\u0440\u0430\u0442, \u043E\u0431\u0449\u0430\u044F \u0441\u0442\u043E\u0438\u043C\u043E\u0441\u0442\u044C \u0434\u0440\u0430\u0433\u043E\u0446\u0435\u043D\u043D\u043E\u0433\u043E \u0438\u0437\u0434\u0435\u043B\u0438\u044F \u0431\u0443\u0434\u0435\u0442:
USD = \u0434\u043E\u043B\u043B\u0430\u0440\u043E\u0432 \u0421\u0428\u0410

list = \u0414\u0440\u0430\u0433. \u043A\u0430\u043C\u043D\u0438
length = \u0414\u043B\u0438\u043D\u0430 (\u043C\u043C)
width = \u0428\u0438\u0440\u0438\u043D\u0430 (\u043C\u043C)
height = \u0412\u044B\u0441\u043E\u0442\u0430 (\u043C\u043C)
hardness = \u041F\u0440\u043E\u0447\u043D\u043E\u0441\u0442\u044C
transparency = \u041F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u044C 

beads = \u0411\u0443\u0441\u044B